hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v1/TAL_RUFNUMMERNEXPORT_REX_MK_01/ERLM.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Note: This file is generated by CDM transformation tool - do not modify this file manually!-->
<SOAP-ENV:Envelope
    xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderNotificationService/v1" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <notifyUpdateOrder>
            <order>
                <geschaeftsfall>REX-MK</geschaeftsfall>
                <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                <geschaeftsfallart>Anbieterwechsel</geschaeftsfallart>
            </order>
            <message>
                <ERLM>
                    <meldungsattribute>
                        <vertragsnummer>${contractId}</vertragsnummer>
                        <externeAuftragsnummer>${externalOrderId}</externeAuftragsnummer>
                        <kundennummer>${customerId}</kundennummer>
                        <kundennummerBesteller>${3rdPartySalesmanCustomerId}</kundennummerBesteller>
                        <erledigungstermin>${deliveryDate}</erledigungstermin>
                        <produktpositionen>
                            <position>
                                <aktionscode>Z</aktionscode>
                                <produkt>
                                    <kategorie>TAL</kategorie>
                                    <bezeichner>TAL; Rufnummernmitnahme Einzelrufnummer</bezeichner>
                                </produkt>
                            </position>
                        </produktpositionen>
                        <TAL>
                            <anschluss>
                                <ONKZ>${rufnummer.onkz.0}</ONKZ>
                                <rufnummer>${rufnummer.dnbase.0}</rufnummer>
                            </anschluss>
                        </TAL>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0010</meldungscode>
                            <meldungstext>Auftrag ausgeführt</meldungstext>
                        </position>
                    </meldungspositionen>
                </ERLM>
            </message>
            <captured>citrus:currentDate(yyyy-MM-dd'T'HH:mm:ss)</captured>
        </notifyUpdateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
